In [2]:
import numpy as np
import pandas as pd

In [3]:
rng = np.random.RandomState(42) # to reproduce same output
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [5]:
rng.randint?

In [7]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list("AB"))
A

   A  B
0  3  7
1  2  1

In [8]:
import pandas as pd
import numpy as np
from IPython.display import display, HTML

CSS = """
.output {
    flex-direction: row;
}
"""

HTML('<style>{}</style>'.format(CSS))

In [9]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

In [11]:
display(df6)
display(df7)
display(df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

     name drink
0    Mary  wine
1  Joseph  beer

In [12]:
CSS = """
.output {
    flex-direction: column;
}
"""

HTML('<style>{}</style>'.format(CSS))

In [13]:
display(df6)
display(df7)
display(df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

     name drink
0    Mary  wine
1  Joseph  beer

In [14]:
x=[1,2,3,4,5]
x=pd.DataFrame(x)
x.describe()

              0
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000